CREATE TABLE materials (
  center VARCHAR(3),
  receive_date DATE,
  material VARCHAR(10)
);

INSERT INTO
  materials
VALUES
  ('東京', '2018-4-01', '錫'),
  ('東京', '2018-4-12', '亜鉛'),
  ('東京', '2018-5-17', 'アルミニウム'),
  ('東京', '2018-5-20', '亜鉛'),
  ('大阪', '2018-4-20', '錫'),
  ('大阪', '2018-4-22', 'ニッケル'),
  ('大阪', '2018-4-29', '鉛'),
  ('名古屋', '2018-3-15', 'チタン'),
  ('名古屋', '2018-4-01', '炭素鋼'),
  ('名古屋', '2018-4-24', '炭素鋼'),
  ('名古屋', '2018-5-02', 'マグネシウム'),
  ('名古屋', '2018-5-10', 'チタン'),
  ('福岡', '2018-5-10', '亜鉛'),
  ('福岡', '2018-5-28', '錫')
